Tekla Open API Reference for Tekla Structures 2025
IAssemblable.GetAssembly Method
 Returns the assembly that the assemblable belongs to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
Assembly GetAssembly()
Function GetAssembly As Assembly
Return Value
Type: Assembly
The assembly that the assemblable belongs to.
See Also
Reference
IAssemblable Interface
Tekla.Structures.Model Namespace